hi = {
  'txt': '''Милости просим в нашу квест-сказку. Тут ты сможешь вместе с новгородским молодцем Садко\
  выполнить несколько заданий и заодно по Кремлю прогуляться.

Сперва-наперво запомни следующие правила, они тебе помогут:
  👇   Скажи "Повтори", если не расслышал, что тебе рассказали 
  ❌  Скажи "Хватит", коль устал ты в дороге и закончить хочешь
  ✨  Скажи "Помоги", чтобы прослушать правила еще раз.

Ты готов отправиться в путь?''',
  'tts': '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/2ce9e269-a82f-460d-a0cf-0bf40c4ebb35.opus">''',
  'buttons': [
      { 'title': "Да", 'hide': True },
      { 'title': "Нет", 'hide': True },
    ]
  }


quest = {
  'buttons': [
      { 'title': "Я на месте", 'hide': False },
      { 'title': "Да", 'hide': False },
      { 'title': "Нет", 'hide': False },
    ]
  }

intro = {
  'buttons': [
      { 'title': "Повтори", 'hide': True },
      { 'title': "Да", 'hide': True },
      { 'title': "Нет", 'hide': True },
    ]
  }

needgeo = {
  'txt': 'Нужен доступ к гео-локации',
  'tts': 'Нужен доступ к гео-локации'
}

help_ = {
  'txt': 'Раздел помощи пользователю',
  'tts': 'Раздел помощи пользователю',
}

start = {
  'txt': 'Вступление',
  'tts': 'Вступление',
}

