hi = {
  'txt': '''Милости просим в квест-сказку. Тут ты сможешь вместе с новогородским молодцем Садко выполнить несколько заданий и заодно по Кремлю прогуляться. Прогуляемся с Садко-молодцем по славному Новгороду?''',
  'tts': '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/d57201b8-42a2-466c-8154-8845616be6d5.opus">''',
  'buttons': [
      { 'title': "Да", 'hide': True },
      { 'title': "Нет", 'hide': True },
    ]
  }

quest = {
  'buttons': [
      { 'title': "Я на месте", 'hide': False },
      { 'title': "Да", 'hide': False },
      { 'title': "Нет", 'hide': False },
    ]
  }

intro = {
  'buttons': [
      { 'title': "Повтори", 'hide': True },
      { 'title': "Да", 'hide': True },
      { 'title': "Нет", 'hide': True },
    ]
  }

needgeo = {
  'txt': 'Чтобы не потеряться в тридевятом црастве возьми волшебный клубок',
  'tts': 'Чтобы не потеряться в тридевятом црастве возьми волшебный клубок'
}

help_ = {
  'txt': 'Раздел помощи пользователю',
  'tts': 'Раздел помощи пользователю',
}

start = {
  'txt': 'Вступление',
  'tts': 'Вступление',
}

