# Текст персонажей, подводка к загадке
pers_step={
    'kupol':[['''Холодом повеяло, ветра поднялись. Видит Садко - из-за купола Кащей идет:\n
        По какой-такой причине ты, холоп, посмел беспокоить меня?
        Если окажется что ты попусту побеспокоил Его Великое Душегубство – не сносить тебе головы!
        Расскажи, что ты от меня хочешь?''', \
        """<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/71ae6263-6cb1-4785-aa33-fb8867d660ed.opus">"""\
              ,'person'],\
        [ '''Ну что, придется тебе на вопрос мой ответить. Ответишь правильно - скажу,\
        куда тебе путь держать, где птицу твою искать. А продуешь, со мной останешься. \
        Будешь под памятником тысячелетия тысячу лет куковать! Значит так. Видишь \
        наверху ангел стоит? ''', \
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/55d60823-e20c-46cc-8439-8c07b22fd6b2.opus">''',\
        'zagadka'], ['''Эх и сказочник ты! Доложили мне мои черти, что жар-птицу ищешь ты! \
        Ну что ж, придется тебе на вопрос мой ответить. Ответишь правильно - скажу \
        куда тебе путь держать, где птицу твою искать. А продуешь, со мной останешься. \
        Будешь под памятником тысячелетия тысячу лет куковать! Значит так. Видишь наверху ангел стоит? '''\
        , '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/60c0ba83-a74a-411a-99dd-0e5f80fdb10c.opus">'''\
        , 'zagadka']],
    'zvonnitsa':[[ '''Оглядел Садко звонницу - видит птица сидит с человеческим лицом, да и молвит:
            -  О, добрый молодец! Принес мне колокольный звон, что любушку свою, ненаглядную порадовать хочешь.\
            Чем помочь я тебе могу, что ищешь ты? ''', \
            """<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/09007db2-6d1c-4263-aea9-d83281bab8f3.opus">"""\
            ,'person'],['''Рассказала бы я где ее искать, да с тех пор как колокола с небес спустились грустно мне и одиноко! \
            Давай я тебе загадку загадаю, порадуешь меня. Ответишь правильно - дам тебе подсказку, где птицу искать,\
            не ответишь - скатертью дорожка! Согласен?''',\
            '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/54bf2755-b0d9-4dd3-8fa0-d8e1ae29ecd5.opus">''',\
            'zagadka'],['''Помочь тебе  только жар-птица сможет! Рассказала бы я где ее искать, да с тех пор как колокола с небес\
            спустились грустно мне и одиноко!Давай я тебе загадку загадаю, порадуешь меня. Ответишь правильно - дам тебе подсказку, \
            где твою птицу искать, не ответишь - скатертью дорожка! Согласен?''',
            '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/2db19094-0f38-45f0-9c45-da5c8338687f.opus">''',\
            'zagadka']],
    'cathedral':[['''Подошел Садко к воротам заморским, искусно умельцами магдебургскими вырезанными, да в качестве трофея в битве\
            с шведскими ворогами в 1187 году захваченными.Видит - Баба-яга сидит, посохом по ступе постукивает, да губами \
            беззубыми причмокивает: \
            Ох и людей сегодня! Ходят все, смотрят, да никто не поговорит со старушкою! Чего тебе надобно, странник?''',\
            '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/318ea1e4-8151-43b3-95a6-4ecfb8a788d8.opus">'''\
            ,'person'],['''Но пока не спеши. Подсоби, бабушке! Обед для гостей важных готовлю я, да что-то не получается. Надобно, \
            чтобы ты мне подсказал, какие явства оставить, да не прогадал, а то гости обозлятся и жар-птицы тебе не видать. Поможешь?''',\
            '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/55ffbd50-f63f-4b85-94f2-0eefc0304e18.opus">''',\
            'zagadka'], ['''Это тебе к жар-птице нашей сердобольной нужно! Но пока не спеши. Подсоби, бабушке! Обед для гостей важных\
            готовлю я, да что-то не получается. Надобно, чтобы ты мне подсказал, какие явства оставить, да не прогадал, \
            а то гости обозлятся и жар-птицы тебе не видать. Поможешь?''',\
            '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/1d794152-81db-484c-8e96-e404edd22b2b.opus">''',\
            'zagadka']]
        }
# Подсказки к загадкам
pers_help={
    999: [['''Посмотри внимательнее на экране. Видишь?''',\
           '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/28d2fd43-d093-4ecc-a58e-75d83bedbd4d.opus">'''\
           ,'''help_not_end''','''997614/b53076acb302868a4ff8'''],['''Ну что ж придется тебе по картине гадать ! Посмотри внимательно на нее. Готов продолжить? Тогда скажи да''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/de64901d-03d6-4778-ad3b-9659df1683e1.opus">''',\
        '''help_end''','''997614/2d529dca1dcd3aae0ed6''']],
    0:[['''Ну что ж даю тебе подсказку! На памятнике изображен первый российский император, военно-морской флот учредивший, \
    да бояр бороды лишивший''','''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/155d945e-2da4-453c-abb6-2cf56c7b739a.opus">''',\
       '''help_not_end''',None],\
      ['''На исходе терпение мое! Вот тебе последняя подсказка. Император этот жил на рубеже 17 и 18 веков, вот образ его тебе''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/337d2ccb-1aeb-4ad1-a15b-1996411a7c23.opus">''',\
       '''help_end''','''965417/d85d9e045690c0627fc0'''],
      ['''Ну все! Я тебя предупреждал, оставайся со мной куковать на тысячи лет! \
      Ну а если вдруг еще раз решишься наш путь пройти - возвращайся!''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/d35df39d-797c-4a20-8bb4-fa4583dab529.opus">''',\
      '''end''',None]],
    1:[['''Ну что ж даю тебе подсказку! На памятнике изображен поэт, родившийся в 1814 году, он стал известен после выхода стихотворения \
    "Смерть Поэта", посвященного Пушкину. Также является автором романа "Герой нашего времени"''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/647a01d2-ca07-42c6-8a0f-28f790cafc81.opus">''',\
       '''help_not_end''',None],\
      ['''На исходе терпение мое! Вот тебе последняя подсказка. Этот поэт долго служил на Кавказе и умер на дуэли, вот тебе его образ''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/f69b2c98-6979-494a-a431-1c973ad29c75.opus">''',\
      '''help_end''', '''1652229/6dd90c56e0dbd2eaa662'''],
      ['''Ну все! Я тебя предупреждал, оставайся со мной куковать на тысячи лет! \
      Ну а если вдруг еще раз решишься наш путь пройти - возвращайся!''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/d35df39d-797c-4a20-8bb4-fa4583dab529.opus">''',\
      '''end''',None]
      ],
    2:[['''Ну что ж даю тебе подсказку! Птица, возрождающаяся после гибели, предвидя свою смерть, осуществляет сожжение себя,\
    после чего появляется вновь из огня''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/0cca3b12-ff77-464f-b97c-ba386745f645.opus">''',\
       '''help_not_end''',None],
      ['''Огорчаешь ты меня! Вот тебе последняя подсказка! Птица эта на картинке изображена ''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/e39cc4eb-4e84-4da6-8146-9a33654af496.opus">''',\
      '''help_end''','''1652229/4ef7c8b4381163c45383'''],
      ['''Ну что ж, путник, вижу устал ты! Прощаться будем! Ну а если вдруг еще раз решишься наш путь пройти - возвращайся!''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/901033f9-efbe-461c-b9bc-2ad6719dbdf1.opus">''',\
      '''end''',None]],
    3:[['''Ну что ж даю тебе подсказку!Транспортное средство это издревна использовалось для обогрева дома''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/cf3bd3a7-791e-4e70-8be2-008178ccd8b0.opus">''',\
       '''help_not_end''',None],
      ['''Огорчаешь ты меня! Вот тебе последняя подсказка! На картине это изображено ''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/b49e163a-c75e-467c-8ad4-4cea45ea519b.opus">''',\
      '''help_end''','''1521359/2803333b1abcb3c2ecce'''],
      ['''Ну что ж, путник, вижу устал ты! Прощаться будем! Ну а если вдруг еще раз решишься наш путь пройти - возвращайся!''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/901033f9-efbe-461c-b9bc-2ad6719dbdf1.opus">''',\
      '''end''',None]],
    4:[['''Ну что ж даю тебе подсказку! Название ее произошло от способа употребления: эту массу накладывали на хлеб, также\
    как и сливочное масло в наши дни. Так что это мазюня или губница?''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/55655a39-5d2e-4f8f-8f67-0a4d96893c40.opus">''',
       '''help_not_end''',None],
      ['''Огорчаешь ты меня! Вот тебе последняя подсказка! Массу на хлеб эту намазывали. Так что это мазюня или губница?''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/187cd499-64cc-4e03-8139-3a64cfd541d1.opus">''',\
      '''help_end''','''965417/cc5ed281c1ec95b6e94c'''],
      ['''Ну все! Оставайся со мной гостей ждать, видимо из тебя обед готовить буду! \
      Ну а если вдруг еще раз решишься наш путь пройти - возвращайся!''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/4a142f8d-0251-47d0-99a6-97266e6dd42d.opus">''',\
      '''end''',None]],
    5:[['''Ну что ж даю тебе подсказку! Щиплет, а не рак. Шипит, а не гадюка. Какое мясо нужно: гусь, кабан, \
    али человечинка подойдет?''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/a65d8ffe-5629-4b3d-b88c-3f794e1ad795.opus">''',\
       '''help_not_end''',None],
      ['''Даю тебе последнюю попытку, а не то точно обед из тебя сделаю! Какое мясо нужно: гусь, кабан, али человечинка подойдет?''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/52dfc780-5e69-4d48-a338-fdeda92e208f.opus">''',\
       '''help_end''','''965417/f6ae20f4cd8811630561'''],
      ['''Ну все! Оставайся со мной гостей ждать, видимо из тебя обед готовить буду! \
      Ну а если вдруг еще раз решишься наш путь пройти - возвращайся!''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/4a142f8d-0251-47d0-99a6-97266e6dd42d.opus">''',\
      '''end''',None]]
}
pers_zag={
    0:[['''Поди-ка найди еще одного ангела на памятнике. Перед ангелом тем человек стоит, руку к сердцу приложил. Скажешь мне,\
    кто тот человек, отпущу тебя с миром, расскажу про жар-птицу. Если  у тебя ответ готов - отвечай. Если нужно повторить \
    загадку, скажи "Повтори"''',
    '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/9767684a-3361-435a-a05d-8f41545af6b6.opus">''',\
     '''zag_not_end''',None],
       ['''Истину глаголишь! Еще что ли тебе, холоп, загадку загадать иль дальше пойдешь?\
       Скажи да, если хочешь загадку, нет - если хочешь пойти дальше.''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/f476eef1-8f31-4356-88d4-e1fe29aaca73.opus">''',\
       '''zag_not_end''',None]],
    1: [['''Ну что ж, странник, от повелителя морского перейдем к сказителям: присмотрись, 
            на нижнем ярусе, подперев рукой подбородок, задумался поэт:

            Белеет парус одинокий
            В тумане моря голубом!..
            Что ищет он в стране далекой?
            Что кинул он в краю родном?..

            Кто это?
            Если  у тебя ответ готов - отвечай. Если нужно повторить загадку, скажи "Повтори"''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/45e49c4e-d857-4431-86b2-6d0e8f37f0dc.opus">''',\
       '''zag_not_end''',None],
       ['''Ну что ж! Лихо ты на на вопросы мои отвечаешь! Сам я жар-птицу не встречал, но слышал песню птичью, красную как колокольный перезвон. Может, это жар-птица с нашей птицей Сирин пела?\
    Ступай к ней. Клубок подскажет, где это. Как готов будешь отправиться в путь, скажи "Я готов".''',\
             '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/12b7b910-c06d-43f0-974b-4471a128888d.opus">''',\
            '''end_pers''','''zvonnitsa''']],
    2:[['''Есть у меня брат, огнем горит, в пепел превращается, заново рождается.  Если  у тебя ответ готов - отвечай. \
        Если нужно повторить загадку, скажи "Повтори"''',\
       '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/8fd68651-748c-46dd-b76b-73d2180df1c3.opus">''',\
       '''zag_not_end''',None],
      ['''Ох и умный ты, добрый молодец! 
            Хочешь еще Птицу Сирин порадовать? Или дальше пойдешь?  Скажи да, если хочешь загадку, \
            нет - если хочешь пойти дальше.''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/408b7b70-e1c4-4722-a123-07253e743efa.opus">''',\
      '''zag_not_end''',None]],
    3:[['''Отгадай, добрый молодец, следующую загадку: какое транспортное средство Емелю привезло к царю? 
 Если  у тебя ответ готов - отвечай. Если нужно повторить загадку, скажи "Повтори"''',\
      '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/62dd5d1a-b454-495d-a28e-6eb69d24411d.opus">''',\
      '''zag_not_end''',None],
      ['''Заслужил ты знать куда путь держать. Прилетала ко мне утречком жар-птица, славно поет она, лапушка. Посидела со мной,\
    яблочко райское склевала, да полетела к Бабе-Яге  в гости. Вон, гляди, купола соборные виднеются. Туда иди, клубок дорожку подскажет.\
    Следуй за ним, путник. Как готов будешь отправиться в путь, скажи "Я готов".''',\
                '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/9d0e2121-7418-4ece-a065-1aebe1e9fc63.opus">''',
              '''end_pers''', '''cathedral''']],
    4: [['''Приготовила я блюдо сладкое из редьки, патоки и пряностей, да два дня в печи томила. А как называется не помню! \
       То ли губница, то ли мазюня. Как называется, подскажи?  Как будет у тебя ответ готов, скажи "Я готов".\
       Если нужно повторить текст, скажи "Повтори"''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/aaa328e3-a385-441e-bdb2-c3ec67650589.opus">''',
        '''zag_not_end''',None],
        ['''Ох и удивил ты меня.Поможешь бабушке дальше или не терпится зазнобушке гостинец принести?\
            Скажи да, если хочешь загадку, нет - если хочешь пойти дальше.''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/21409438-f58a-4df1-bef1-2d0322959cd2.opus">''',\
        '''zag_not_end''',None]],
    5: [['''Пора-ка бы к основному, мясному переходить, упитанный ты мой!  Вот хочу я приготовить Полоток,\
        да не помню, какое мясо нужно: гусь, кабан, али человечинка подойдет? Как будет у тебя ответ готов, скажи\
        "Я готов". Если нужно повторить текст, скажи "Повтори"''',
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/4554996f-6668-4ecb-b29e-24fed004b719.opus">''',\
        '''zag_not_end''',None],
       ['''Ну ладно, уговорил! Расскажу все тебе как есть! Погляди-ка ты наверх: видишь купол золотой, а на нем голубь притаился с давних,\
    темных времен. Это и есть птица твоя чудесная. Непроста эта птица, да каждого новгородца привечает и помочь старается. Удивительна история ее, если \
    хочешь услышать ее скажи "Да", если устал ты - скажи "нет"''',\
                '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/631704d9-94f0-4bb6-91fd-46c1422201ad.opus">''',
                '''end_pers''','end']],
       
       
}
pers_zagadka={
    'kupol':[0,1],
    'zvonnitsa':[2,3],
    'cathedral':[4,5]
}
# place=pers_zagadka['kupol']
pers_zag[pers_zagadka['kupol'][0]][1][0]
# Справочник загадок по персонажам
pers_sprav={
    'kupol':[0,1],
    'zvonnitsa':[2,3],
    'cathedral':[4,5]
}
# Концовка персонажа

# Ответы правильные
answer={
    'kupol':{
        0:'petr',
        1:'lermontov'},
    'zvonnitsa':{
        2:'phoenix',
        3:'pechka'},
    'cathedral':{
        4:'mazyunya',
        5:'goose'},
}
fallback_answer={
    'kupol':[
        [
        '''Извините я вас не понял. Повторите еще раз, да, или нет''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/7eee26d9-1aa0-436d-95d1-f2250527cc1d.opus">''',
        'fallback_answer'
             ],
        [
        '''Извините я вас не поняла. Скоро сказка сказывается, да не скоро дело делается. Я и Садко, будем ждать тебя. \
             Возвращайся скорей!''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/0ba14122-3b4f-4b68-a271-72e3227ca7df.opus">''',
        '''end'''
        ],
        [
        '''Ну что ж путник, вижу устал ты! Коль загадку тебе рассказать - скажи да, коль прощаться будем - скажи нет''',
         '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/1dc052d1-ccad-4f34-adb7-4b91361fc441.opus">''',
        'fallback_answer'
        ]
    ],
    'zvonnitsa': [
        [
            '''Извините я вас не поняла. Повторите еще раз, да, или нет''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/258ddd37-5a00-46cc-a783-cd86aeac4ad7.opus">''',
            'fallback_answer'
        ],
        [
            '''Извините я вас не поняла. Скоро сказка сказывается, да не скоро дело делается. Я и Садко, будем ждать тебя. \
             Возвращайся скорей!''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/0ba14122-3b4f-4b68-a271-72e3227ca7df.opus">''',
        '''end'''
        ],
        [
            '''Ну что ж путник, вижу устал ты! Коль загадку тебе рассказать - скажи да, коль прощаться будем - скажи нет''',
         '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/16c0971c-be82-4412-8de9-ef05450dc099.opus">''',
        'fallback_answer'
        ]
    ],
    'cathedral':[
        [
            '''Извините я вас не поняла. Повторите еще раз, да, или нет''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/fd6a4789-7e30-402f-9485-d866ec21789b.opus">''',
        'fallback_answer'
        ],
        [
            '''Извините я вас не поняла. Скоро сказка сказывается, да не скоро дело делается. Я и Садко, будем ждать тебя. \
             Возвращайся скорей!''',\
        '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/0ba14122-3b4f-4b68-a271-72e3227ca7df.opus">''',
        '''end'''
        ],
        [
            '''Ну что ж путник, вижу устал ты! Коль загадку тебе рассказать - скажи да, коль прощаться будем - скажи нет''',
         '''<speaker audio="dialogs-upload/ba73ad37-33af-4bea-8c8d-b6689c2febdd/ceda0888-7f8a-4673-9e21-aae7d0d910a6.opus">''',
        'fallback_answer'
        ]
    ]
    
}
