sights = {

  'kupol': {
    'name': "Па́мятник Тысячеле́тию Росси́и",
    '_location': {
      'lat': 58.52114,
      'lon': 31.27527
    },
    # fake
    'location' : {
      'lat': 59.91284,
      'lon': 30.50925
    },
  },

  'zvonnitsa': {
    'name': "Звонница Софийского собора",
    '_location': {
      'lat': 58.52144,
      'lon': 31.27748,  
    },
    # fake 59.91176/30.50887
    'location' : {
      'lat': 59.91176,
      'lon': 30.50887
    },
  },

  'cathedral': {
    'name': "Софийский кафедральный собор",
    '_location': {
      'lat': 58.52209,
      'lon': 31.27669,  
    },
    # fake 59.91192/30.50746
    'location' : {
      'lat': 59.91192,
      'lon': 30.50746
    },
  },
  
  'westGate': {
    'name': "Западные ворота Кремля",
    'location': {
      'lat': 58.521957,
      'lon': 31.273635,  
    },
  },

  'eastGate': {
    'name': "Восточные ворота Кремля",
    'location': {
      'lat': 58.520895,
      'lon': 31.277567, 
    },
  },

  'bridge': {
    'name': "Мост через Оккервиль в парке",
    'location': {
      'lat': 59.911148,
      'lon': 30.508596, 
    },
  },

  'alcove': {
    'name': "Беседка в Брумфилде",
    'location': {
      'lat': 39.911708,
      'lon': -105.149984, 
    },
  },

  'swing': {
    'name': "Качели в Мурино",
    'location': {
      'lat': 60.052969,
      'lon': 30.421906, 
    },
  },

}